package Homework_4;

import Homework_4.BTree.Node;


public class BT {
	
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int[] array = {40, 11, 77, 33, 20, 90, 99, 70, 88, 80, 66, 10, 22, 30, 44, 55, 50, 60, 100, 28, 9, 5, 17, 6, 3, 1, 4, 2, 7, 8, 73, 12, 13, 14, 16, 15, 25, 24, 28, 45, 49, 42, 43, 41, 47, 48, 46, 63, 68, 61, 62, 64, 69, 67, 65, 54, 59, 58, 51, 53, 57, 52, 56, 83, 81, 82, 84, 75, 89};
//				, 28, 45, 49, 42, 43, 41, 47, 48, 46, 63, 68, 61, 62, 64, 69, 67, 65, 54, 59, 58, 51, 53, 57, 52, 56, 83, 81, 82, 84, 75, 89};

//		{40, 11, 77, 33, 20, 90, 70, 96, 37, 23, 24, 98, 130, 150, 110, 120, 100, 105};
//				, 90, 70, 96};
//				99, 100, 98, 9d cc 
			//	, 20, 90, 99, 70, 8 0  80, 66, 10, 22, 30, 44, 55, 50, 60, 100, 28, 18, 9, 5, 17, 6, 3, 1, 4, 2, 7, 8, 73, 12, 13, 14, 16, 15, 25, 24, 28, 45, 49, 42, 43, 41, 47, 48, 46, 63, 68, 61, 62, 64, 69, 67, 65, 54, 59, 58, 51, 53, 57, 52, 56, 83, 81, 82, 84, 75, 89};
//40, 11, 77, 33, 20, 90, 99, 70, 88, 80, 66, 10, 22, 30, 44, 55, 50, 60, 100, 28, 18, 9, 5, 17, 6, 3, 1, 4, 2, 7, 8, 73, 12, 13, 14, 16, 15, 25, 24, 28, 45, 49, 42, 43, 41, 47, 48, 46, 63, 68, 61, 62, 64, 69, 67, 65, 54, 59, 58, 51, 53, 57, 52, 56, 83, 81, 82, 84, 75, 89};

//		//m이 3인 경우
//		BTree BT = new BTree();
//		Node T = null;	
//		
//		for (int i = 0; i < array.length ; i++) {
//			T = BT.insertBT(T, 3, array[i]); BT.inorderBT(T, 3); System.out.println();
//		}
		
		//m이 4인 경우
		BTree BT2 = new BTree();
		Node T2 = null;
		
		for (int i = 0; i < array.length ; i++) {
			T2 = BT2.insertBT(T2, 4, array[i]); BT2.inorderBT(T2, 4); System.out.println();
		}
//		T2 = BT2.deleteBT(T2, 4, 77); BT2.inorderBT(T2, 4); System.out.println();
//		T2 = BT2.deleteBT(T2, 4, 100); BT2.inorderBT(T2, 4); System.out.println();
//		T2 = BT2.deleteBT(T2, 4, 70); BT2.inorderBT(T2, 4); System.out.println();

	}

}
